cmsis-svd/cmsis-svd/data/Fujitsu/S6E1A1.xml
        <!-- REGISTER "INT_STR" -->
        <register>
          <name>INT_STR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x64</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x27</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSI" -->
            <field>
              <name>FCSI</name>
              <description>Anomalous frequency detection interrupt status bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PCSI" -->
            <field>
              <name>PCSI</name>
              <description>PLL oscillation stabilization wait completion interrupt status bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SCSI" -->
            <field>
              <name>SCSI</name>
              <description>Sub clock oscillation stabilization wait completion interrupt status bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MCSI" -->
            <field>
              <name>MCSI</name>
              <description>Main clock oscillation stabilization wait completion interrupt status bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INT_CLR" -->
        <register>
          <name>INT_CLR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x68</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x27</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSC" -->
            <field>
              <name>FCSC</name>
              <description>Anomalous frequency detection interrupt factor clear bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "PCSC" -->
            <field>
              <name>PCSC</name>
              <description>PLL oscillation stabilization wait completion interrupt factor clear bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SCSC" -->
            <field>
              <name>SCSC</name>
              <description>Sub clock oscillation stabilization wait completion interrupt factor clear bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "MCSC" -->
            <field>
              <name>MCSC</name>
              <description>Main clock oscillation stabilization wait completion interrupt factor clear bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STB_CTL" -->
        <register>
          <name>STB_CTL</name>
          <description>Standby Mode Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0017</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "KEY" -->
            <field>
              <name>KEY</name>
              <description>Standby mode control write control bits</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPL" -->
            <field>
              <name>SPL</name>
              <description>Standby pin level setting bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DSTM" -->
            <field>
              <name>DSTM</name>
              <description>Deep standby mode select bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STM" -->
            <field>
              <name>STM</name>
              <description>Standby mode selection bits</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RST_STR" -->
        <register>
          <name>RST_STR</name>
          <description>Reset Cause Register</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0001</resetValue>
          <resetMask>0x01F3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRST" -->
            <field>
              <name>SRST</name>
              <description>Software reset flag</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FCSR" -->
            <field>
              <name>FCSR</name>
              <description>Flag for anomalous frequency detection reset</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CSVR" -->
            <field>
              <name>CSVR</name>
              <description>Clock failure detection reset flag</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "HWDT" -->
            <field>
              <name>HWDT</name>
              <description>Hardware watchdog reset flag</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SWDT" -->
            <field>
              <name>SWDT</name>
              <description>Software watchdog reset flag</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INITX" -->
            <field>
              <name>INITX</name>
              <description>INITX pin input reset flag</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PONR" -->
            <field>
              <name>PONR</name>
              <description>Power-on reset/low-voltage detection reset flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSV_CTL" -->
        <register>
          <name>CSV_CTL</name>
          <description>CSV control register</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7003</resetValue>
          <resetMask>0x7303</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCD" -->
            <field>
              <name>FCD</name>
              <description>FCS count cycle setting bits</description>
              <lsb>12</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCSRE" -->
            <field>
              <name>FCSRE</name>
              <description>FCS reset output enable bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCSDE" -->
            <field>
              <name>FCSDE</name>
              <description>FCS function enable bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCSVE" -->
            <field>
              <name>SCSVE</name>
              <description>Sub CSV function enable bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCSVE" -->
            <field>
              <name>MCSVE</name>
              <description>Main CSV function enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSV_STR" -->
        <register>
          <name>CSV_STR</name>
          <description>CSV status register</description>
          <addressOffset>0x44</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCMF" -->
            <field>
              <name>SCMF</name>
              <description>Sub clock failure detection flag</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MCMF" -->
            <field>
              <name>MCMF</name>
              <description>Main clock failure detection flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
