cmsis-svd/cmsis-svd/data/Fujitsu/S6E1A1.xml
        <!-- REGISTER "IRQ06MON" -->
        <register>
          <name>IRQ06MON</name>
          <description>IRQ06 Batch Read Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QUD2INT5" -->
            <field>
              <name>QUD2INT5</name>
              <description>PC match and RC match interrupt request of QPRC ch.2</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD2INT4" -->
            <field>
              <name>QUD2INT4</name>
              <description>Interrupt request detected RC out of range of QPRC ch.2</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD2INT3" -->
            <field>
              <name>QUD2INT3</name>
              <description>PC count invert interrupt request of QPRC ch.2</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD2INT2" -->
            <field>
              <name>QUD2INT2</name>
              <description>Overflow/underflow/zero index interrupt request of QPRC ch.2</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD2INT1" -->
            <field>
              <name>QUD2INT1</name>
              <description>PC and RC match interrupt request of QPRC ch.2</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD2INT0" -->
            <field>
              <name>QUD2INT0</name>
              <description>PC match interrupt request of QPRC ch.2</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD1INT5" -->
            <field>
              <name>QUD1INT5</name>
              <description>PC match and RC match interrupt request of QPRC ch.1</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD1INT4" -->
            <field>
              <name>QUD1INT4</name>
              <description>Interrupt request detected RC out of range of QPRC ch.1</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD1INT3" -->
            <field>
              <name>QUD1INT3</name>
              <description>PC count invert interrupt request of QPRC ch.1</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD1INT2" -->
            <field>
              <name>QUD1INT2</name>
              <description>Overflow/underflow/zero index interrupt request of QPRC ch.1</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD1INT1" -->
            <field>
              <name>QUD1INT1</name>
              <description>PC and RC match interrupt request of QPRC ch.1</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD1INT0" -->
            <field>
              <name>QUD1INT0</name>
              <description>PC match interrupt request of QPRC ch.1</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT5" -->
            <field>
              <name>QUD0INT5</name>
              <description>PC match and RC match interrupt request of QPRC ch.0</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT4" -->
            <field>
              <name>QUD0INT4</name>
              <description>Interrupt request detected RC out of range of QPRC ch.0</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT3" -->
            <field>
              <name>QUD0INT3</name>
              <description>PC count invert interrupt request of QPRC ch.0</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT2" -->
            <field>
              <name>QUD0INT2</name>
              <description>Overflow/underflow/zero index interrupt request of QPRC ch.0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT1" -->
            <field>
              <name>QUD0INT1</name>
              <description>PC and RC match interrupt request of QPRC ch.0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT0" -->
            <field>
              <name>QUD0INT0</name>
              <description>PC match interrupt request of QPRC ch.0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TIMINT2" -->
            <field>
              <name>TIMINT2</name>
              <description>Dual timer TIMINT2 interrupt request</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TIMINT1" -->
            <field>
              <name>TIMINT1</name>
              <description>Dual timer TIMINT1 interrupt request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
