cmsis-svd/cmsis-svd/data/Fujitsu/S6E1A1.xml
        <!-- REGISTER "PDIR3" -->
        <register>
          <name>PDIR3</name>
          <description>Port Input Data Register 3</description>
          <addressOffset>0x30C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FE00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3F" -->
            <field>
              <name>P3F</name>
              <description>Bit15 of PDIR3</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3E" -->
            <field>
              <name>P3E</name>
              <description>Bit14 of PDIR3</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3D" -->
            <field>
              <name>P3D</name>
              <description>Bit13 of PDIR3</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3C" -->
            <field>
              <name>P3C</name>
              <description>Bit12 of PDIR3</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3B" -->
            <field>
              <name>P3B</name>
              <description>Bit11 of PDIR3</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3A" -->
            <field>
              <name>P3A</name>
              <description>Bit10 of PDIR3</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P39" -->
            <field>
              <name>P39</name>
              <description>Bit9 of PDIR3</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDIR4" -->
        <register>
          <name>PDIR4</name>
          <description>Port Input Data Register 4</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000006C0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P4A" -->
            <field>
              <name>P4A</name>
              <description>Bit10 of PDIR4</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P49" -->
            <field>
              <name>P49</name>
              <description>Bit9 of PDIR4</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P47" -->
            <field>
              <name>P47</name>
              <description>Bit7 of PDIR4</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P46" -->
            <field>
              <name>P46</name>
              <description>Bit6 of PDIR4</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDIR5" -->
        <register>
          <name>PDIR5</name>
          <description>Port Input Data Register 5</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P52" -->
            <field>
              <name>P52</name>
              <description>Bit2 of PDIR5</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P51" -->
            <field>
              <name>P51</name>
              <description>Bit1 of PDIR5</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P50" -->
            <field>
              <name>P50</name>
              <description>Bit0 of PDIR5</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDIR6" -->
        <register>
          <name>PDIR6</name>
          <description>Port Input Data Register 6</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P61" -->
            <field>
              <name>P61</name>
              <description>Bit1 of PDIR6</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P60" -->
            <field>
              <name>P60</name>
              <description>Bit0 of PDIR6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDIR8" -->
        <register>
          <name>PDIR8</name>
          <description>Port Input Data Register 8</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P82" -->
            <field>
              <name>P82</name>
              <description>Bit2 of PDIR8</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P81" -->
            <field>
              <name>P81</name>
              <description>Bit1 of PDIR8</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P80" -->
            <field>
              <name>P80</name>
              <description>Bit0 of PDIR8</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
