cmsis-svd/cmsis-svd/data/Fujitsu/S6E1A1.xml
        <!-- REGISTER "EPFR18" -->
        <register>
          <name>EPFR18</name>
          <description>Extended Pin Function Setting Register 18</description>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CECR1B" -->
            <field>
              <name>CECR1B</name>
              <description>CEC1 input/output selection bits</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CECR0B" -->
            <field>
              <name>CECR0B</name>
              <description>CEC0 input/output selection bits</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR21" -->
        <register>
          <name>EPFR21</name>
          <description>Extended Pin Function Setting Register 21</description>
          <addressOffset>0x654</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QZIN0S" -->
            <field>
              <name>QZIN0S</name>
              <description>QPRC-ch.0 ZIN Input Pin bits</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QBIN0S" -->
            <field>
              <name>QBIN0S</name>
              <description>QPRC-ch.0 BIN Input Pin bits</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QAIN0S" -->
            <field>
              <name>QAIN0S</name>
              <description>QPRC-ch.0 AIN Input Pin bits</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR22" -->
        <register>
          <name>EPFR22</name>
          <description>Extended Pin Function Setting Register 22</description>
          <addressOffset>0x658</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000F0F0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCS31E" -->
            <field>
              <name>SCS31E</name>
              <description>SCS31 Output Select bits</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS30B" -->
            <field>
              <name>SCS30B</name>
              <description>SCS30 Input/Output Select bits</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS11E" -->
            <field>
              <name>SCS11E</name>
              <description>SCS11 Output Select bits</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCS10B" -->
            <field>
              <name>SCS10B</name>
              <description>SCS10 Input/Output Select bits</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PZR0" -->
        <register derivedFrom="DDR0">
          <name>PZR0</name>
          <description>Port Pseudo Open Drain Setting Register 0</description>
          <addressOffset>0x700</addressOffset>
        </register>
        <!-- REGISTER "PZR1" -->
        <register derivedFrom="DDR1">
          <name>PZR1</name>
          <description>Port Pseudo Open Drain Setting Register 1</description>
          <addressOffset>0x704</addressOffset>
        </register>
        <!-- REGISTER "PZR2" -->
        <register derivedFrom="DDR2">
          <name>PZR2</name>
          <description>Port Pseudo Open Drain Setting Register 2</description>
          <addressOffset>0x708</addressOffset>
        </register>
        <!-- REGISTER "PZR3" -->
        <register derivedFrom="DDR3">
          <name>PZR3</name>
          <description>Port Pseudo Open Drain Setting Register 3</description>
          <addressOffset>0x70C</addressOffset>
        </register>
        <!-- REGISTER "PZR4" -->
        <register derivedFrom="DDR4">
          <name>PZR4</name>
          <description>Port Pseudo Open Drain Setting Register 4</description>
          <addressOffset>0x710</addressOffset>
        </register>
        <!-- REGISTER "PZR5" -->
        <register derivedFrom="DDR5">
          <name>PZR5</name>
          <description>Port Pseudo Open Drain Setting Register 5</description>
          <addressOffset>0x714</addressOffset>
        </register>
        <!-- REGISTER "PZR6" -->
        <register derivedFrom="DDR6">
          <name>PZR6</name>
          <description>Port Pseudo Open Drain Setting Register 6</description>
          <addressOffset>0x718</addressOffset>
        </register>
        <!-- REGISTER "PZR8" -->
        <register derivedFrom="DDR8">
          <name>PZR8</name>
          <description>Port Pseudo Open Drain Setting Register 8</description>
          <addressOffset>0x720</addressOffset>
        </register>
        <!-- REGISTER "PZRE" -->
        <register derivedFrom="DDRE">
          <name>PZRE</name>
          <description>Port Pseudo Open Drain Setting Register E</description>
          <addressOffset>0x738</addressOffset>
        </register>
        <!-- REGISTER "FPOER0" -->
        <register>
          <name>FPOER0</name>
          <description>Fast GPIO Output Enable Register 0</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000801F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P0F" -->
            <field>
              <name>P0F</name>
              <description>Bit15 of FPOER0</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P04" -->
            <field>
              <name>P04</name>
              <description>Bit4 of FPOER0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P03" -->
            <field>
              <name>P03</name>
              <description>Bit3 of FPOER0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P02" -->
            <field>
              <name>P02</name>
              <description>Bit2 of FPOER0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P01" -->
            <field>
              <name>P01</name>
              <description>Bit1 of FPOER0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "P00" -->
            <field>
              <name>P00</name>
              <description>Bit0 of FPOER0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
