cmsis-svd/cmsis-svd/data/Fujitsu/S6E1A1.xml
        <!-- REGISTER "M_FPDIR1" -->
        <register>
          <name>M_FPDIR1</name>
          <description>Mirror Fast GPIO Input Data Register 1</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P47" -->
            <field>
              <name>P47</name>
              <description>Bit7 of M_FPDIR1</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P46" -->
            <field>
              <name>P46</name>
              <description>Bit6 of M_FPDIR1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3F" -->
            <field>
              <name>P3F</name>
              <description>Bit5 of M_FPDIR1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3E" -->
            <field>
              <name>P3E</name>
              <description>Bit4 of M_FPDIR1</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3D" -->
            <field>
              <name>P3D</name>
              <description>Bit3 of M_FPDIR1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3C" -->
            <field>
              <name>P3C</name>
              <description>Bit2 of M_FPDIR1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3B" -->
            <field>
              <name>P3B</name>
              <description>Bit1 of M_FPDIR1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "P3A" -->
            <field>
              <name>P3A</name>
              <description>Bit0 of M_FPDIR1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "M_FPDOR0" -->
        <register>
          <name>M_FPDOR0</name>
          <description>Mirror Fast GPIO Output Data Register 0</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P22" -->
            <field>
              <name>P22</name>
              <description>Bit7 of M_FPDOR0</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P23" -->
            <field>
              <name>P23</name>
              <description>Bit6 of M_FPDOR0</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P15" -->
            <field>
              <name>P15</name>
              <description>Bit5 of M_FPDOR0</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P14" -->
            <field>
              <name>P14</name>
              <description>Bit4 of M_FPDOR0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P13" -->
            <field>
              <name>P13</name>
              <description>Bit3 of M_FPDOR0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P12" -->
            <field>
              <name>P12</name>
              <description>Bit2 of M_FPDOR0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P11" -->
            <field>
              <name>P11</name>
              <description>Bit1 of M_FPDOR0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P10" -->
            <field>
              <name>P10</name>
              <description>Bit0 of M_FPDOR0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "M_FPDOR1" -->
        <register>
          <name>M_FPDOR1</name>
          <description>Mirror Fast GPIO Output Data Register 1</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P47" -->
            <field>
              <name>P47</name>
              <description>Bit7 of M_FPDOR1</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P46" -->
            <field>
              <name>P46</name>
              <description>Bit6 of M_FPDOR1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3F" -->
            <field>
              <name>P3F</name>
              <description>Bit5 of M_FPDOR1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3E" -->
            <field>
              <name>P3E</name>
              <description>Bit4 of M_FPDOR1</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3D" -->
            <field>
              <name>P3D</name>
              <description>Bit3 of M_FPDOR1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3C" -->
            <field>
              <name>P3C</name>
              <description>Bit2 of M_FPDOR1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3B" -->
            <field>
              <name>P3B</name>
              <description>Bit1 of M_FPDOR1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3A" -->
            <field>
              <name>P3A</name>
              <description>Bit0 of M_FPDOR1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
 </peripherals>
</device>